[
    {
        "name": "SanDisk Ultra 128GB-SDXC-UHS-I Memory card up to 80MB/s",
        "price": 45.89,
        "description": "Ultra-fast cards (2) to take better pictures and  full HD videos  (1)  with your compact to mid-range pint-and-shoot camerasand camcoders. With SanDisk ultra SDXC UHS-I cards you'll benefit from faster downlods, high quality and better performance to capture and store 128GB (s)  of high quality pictures and Full HD video (1). Take advantage of ultra-fast read speeds of up to 80MB/s (3) to save time moving photos and videos from the card to your computer. From a reader in flash memory starage, sanDisk ultra SDXC UHS-I cards are compatible with SDHC ADN SDXC digital divices, and come with a 10-year limited warranty (6).",
        "ratings": 5,
        "images": [
            {
                "public_id": "products/tzfsnrli3szrdnb4jgge",
                "url": "https://res.cloudinary.com/shopit/images/upload/v1606231282/products/tzfsnrli3szrdnb4jgge.jpg"
            }
        ],
        "category": "Electronics",
        "seller": "Ebay",
        "stock": 50,
        "numOfReviews": 32,
        "reviews": []
    },
    {
        "name": "Nikon D3500 W/ AF-P DX NIKKOR 18-55mm f/3.5-5.6G VR Black",
        "price": 949.99,
        "description": "You don't need to be a photographer to know a great photo when you see one. And you don't need to a photographer to take a great photo you just need the D3500. It's as easy to use as a point-and-shoot, but it takes beautiful DSLR photos and controls where you want them. It's compact, durable and versatile, ideal for travel. And It works seamlessly with compatible smartphones, making it easier than ever to share your great photos. Even if you've never picked up a DSLR camera, you can take beautiful pictures with D3500",
        "ratings": 4.7,
        "images": [
            {
                "public_id": "products/",
                "url": "https://res.cloudinary.com/shopit/images/upload/v1606231282/products/macbook_02cj2k"
            }
        ],
        "category": "Cameras",
        "seller": "Amazon",
        "stock": 131,
        "numOfReviews": 222,
        "reviews": []
    },
    {
        "name": "Apple MacBook Air (13-inch, 8GB RAM, 256GB SSD Storage) - Space Gray",
        "price": 949.99,
        "description": "Stunning 13.3 -inch Retina display with True Tone technology, Backlight Magic Keyboard and TouchID, Tenth-generation, Intel Core i3 processor, Intel Irish Plus Graphics, Fast SSD storage, 8GB of memory, Stereo speakers with wider stereo sound",
        "ratings": 3.5,
        "images": [
            {
                "public_id": "products/macbook_02cj2k",
                "url": "https://res.cloudinary.com/shopit/images/upload/v1606231282/products/macbook_02cj2k"
            }
        ],
        "category": "Laptops",
        "seller": "Amazon",
        "stock": 0,
        "numOfReviews": 56,
        "reviews": []
    }
]